Repository: Voldy87/all-nba-team
Catalog: all_nba_team/locale/*/LC_MESSAGES/django.po
Languages: it

source: history
it: storia

source: Winners' list
it: lista dei premiati

source: records
it: primati

source: Complete list
it: Elenco completo

source: 10 or more selections
it: Più di 9 selezioni

source: Stats Leading
it: Leader stagionali

source: Rookie primacies
it: Record per rookie

source: Overall selections
it: Selezioni complessive

source: Selection streaks
it: Selezioni consecutive

source: Role sorting
it: Selezioni per ruolo

source: Age primacies
it: Primati d'età

source: Choices with single team
it: Scelte con una franchigia

source: Choices with multiple teams
it: Scelte con diverse franchigie

source: All-NBA Teams History
it: Un po' di storia..

source: Back to
it: Torna alla

source: Home
it: Home Page

source: Terms of Use
it: Termini d'utilizzo

source: List of recipients
it: Elenco vincitori

source: Statistics
it: statistiche

source: Records
it: primati

source: presents
it: ha l'onore di presentare

source: enter
it: entra

source: Want to know more about the author?
it: informazioni sull'autore?

source: see here
it: qui

source: a Voldy87 work
it: un sito di Voldy87
